app/views/posts/show.html.erb

      <!-- if文を用いて、表示内容を切り替えてください -->
      <% if Like.find_by(user_id:@current_user.id,post_id:@post.id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 6], ["post_id", 8], ["LIMIT", 1]]