app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "ああ"], ["created_at", "2024-11-03 07:27:09.542183"], ["updated_at", "2024-11-03 07:27:09.542183"], ["user_id", 6]]
---
  def create
    @post = Post.new(content: params[:content])
    if @post.save