app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password", "image_name") VALUES (?, ?, ?, ?, ?, ?)  [["name", "rino"], ["email", "rino@rino"], ["created_at", "2024-11-08 11:08:05.942892"], ["updated_at", "2024-11-08 11:08:05.942892"], ["password", "[FILTERED]"], ["image_name", "default_user.jpg"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2024-11-08 11:08:38.900945"], ["image_name", "7.jpg"], ["id", 7]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "mint@316"], ["password", "[FILTERED]"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email], password: params[:password])